; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image1 - mode
	image2 - mode
	image0 - mode
	GroundStation4 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(pointing satellite1 Planet9)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image2)
	(have_image Planet8 image1)
	(have_image Planet9 image2)
	(have_image Star10 image2)
	(have_image Phenomenon11 image0)
	(have_image Phenomenon12 image1)
	(have_image Planet13 image2)
	(have_image Planet14 image2)
	(have_image Star15 image2)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 12
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 12
4. (turn_to satellite0 phenomenon5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 12
5. (take_image satellite0 phenomenon5 instrument1 image2)
   added: (have_image phenomenon5 image2)
   goals met: 2 of 12
6. (turn_to satellite0 phenomenon12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 12
7. (take_image satellite0 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 3 of 12
8. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 12
9. (take_image satellite0 phenomenon11 instrument1 image0)
   added: (have_image phenomenon11 image0)
   goals met: 4 of 12
10. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 12
11. (take_image satellite0 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 5 of 12
12. (turn_to satellite0 planet13 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet13)
   goals met: 5 of 12
13. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 6 of 12
14. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 6 of 12
15. (take_image satellite0 planet14 instrument1 image2)
   added: (have_image planet14 image2)
   goals met: 7 of 12
16. (turn_to satellite0 planet7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet7)
   goals met: 7 of 12
17. (take_image satellite0 planet7 instrument1 image2)
   added: (have_image planet7 image2)
   goals met: 8 of 12
18. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 8 of 12
19. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 9 of 12
20. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 9 of 12
21. (take_image satellite0 planet9 instrument1 image2)
   added: (have_image planet9 image2)
   goals met: 10 of 12
22. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 10 of 12
23. (take_image satellite0 star10 instrument1 image2)
   added: (have_image star10 image2)
   goals met: 11 of 12
24. (turn_to satellite0 star15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star15)
   goals met: 11 of 12
25. (take_image satellite0 star15 instrument1 image2)
   added: (have_image star15 image2)
   goals met: 12 of 12
